_protected/views/layouts/headerindex.php

use app\models\TumansShahars;
use yii\helpers\Url;
use yii\helpers\Html;
$menu = Viloyats::find()->all();
---
SELECT * FROM `viloyats`

                    <a class="nav-link dropdown-toggle" href="#" id="navbarDropdown" role="button" data-toggle="dropdown" aria-haspopup="true" aria-expanded="false">
                        <?=$m->name?>
                    </a>
                    <?$child = TumansShahars::find()->where(['viloyat_id'=>$m->id])->all()?>
---
SELECT * FROM `tumans_shahars` WHERE `viloyat_id`=1