_protected/controllers/SiteController.php

    public function actionIndex($slug = '', $item_slug = '')
    {
        if ($slug){
            $menu = TumansShahars::find()->where(['slug'=>$slug])->one();
            $shop = Shops::find()->where(['tumans_shahars_id'=>$menu->id])->all();
            if ($item_slug) {
                $shop = Shops::find()->where(['slug'=>$item_slug])->orderBy(['id'=>SORT_DESC])->all();
---
SELECT * FROM `tumans_shahars` WHERE `slug`='asaka'
SELECT * FROM `shops` WHERE `tumans_shahars_id`=1
SELECT * FROM `shops` WHERE `slug`='sport' ORDER BY `id` DESC

    public function renderPage($shop, $menu)
    {

        $shop_item = ShopItems::find()->where(['shop_id'=>$shop[0]->id])->all();
        $shop = $shop[0];
//        $shop_item = $shop_item[0];
        $shop->views += 1;
        $shop->save(false);
---
SELECT * FROM `shop_items` WHERE `shop_id`=1
UPDATE `shops` SET `views`=2, `update_date`='2020-10-20' WHERE `id`=6

    public function renderPages($slug)
    {
        $menu = TumansShahars::find()->where(['slug'=>$slug])->one();
        // sardor
        $query = Shops::find()->where(['tumans_shahars_id'=>$menu->id])
//            ->andWhere(['status'=>[MenuItem::STATUS_ACTIVE,MenuItem::STATUS_INACTIVE]]);
            ->andWhere(['status'=>1]);

        $countQuery = clone $query;

        $pages = new Pagination([
            'totalCount' => $countQuery->count(),
            'pageSize' => 12 ]);
        $models = $query->offset($pages->offset)->orderBy(['id'=>SORT_DESC])->limit($pages->limit)->all();
---
SELECT * FROM `tumans_shahars` WHERE `slug`='asaka'
SELECT COUNT(*) FROM `shops` WHERE (`tumans_shahars_id`=1) AND (`status`=1)
SELECT * FROM `shops` WHERE (`tumans_shahars_id`=1) AND (`status`=1) ORDER BY `id` DESC LIMIT 12