_protected/modules/admin/views/shops/index.php




$d = \app\models\TumansShahars::find()->all();
---
SELECT * FROM `tumans_shahars`