_protected/modules/admin/controllers/ShopsController.php

SELECT * FROM `shops` WHERE `id`='3'
---
    protected function findModel($id)
    {
        if (($model = Shops::findOne($id)) !== null) {