_protected/modules/admin/controllers/TumansShaharsController.php

SELECT * FROM `tumans_shahars` WHERE `id`='7'
---
    protected function findModel($id)
    {
        if (($model = TumansShahars::findOne($id)) !== null) {